
# Импортируем класс, который говорит нам о том,
# что в этом представлении мы будем выводить список объектов из БД
from django.views.generic import ListView, DetailView
from .models import Post
from datetime import datetime

class PostList(ListView):
    # Указываем модель, объекты которой мы будем выводить
    model = Post
    # Поле, которое будет использоваться для сортировки объектов
    ordering = '-time_in'
    # Указываем имя шаблона, в котором будут все инструкции о том,
    # как именно пользователю должны быть показаны наши объекты
    template_name = 'news.html'
    # Это имя списка, в котором будут лежать все объекты.
    # Его надо указать, чтобы обратиться к списку объектов в html-шаблоне.
    context_object_name = 'news'

    # Метод get_context_data позволяет нам изменить набор данных,
    # который будет передан в шаблон.
def get_context_data(self, **kwargs):
    # С помощью super() мы обращаемся к родительским классам
    # и вызываем у них метод get_context_data с теми же аргументами,
    # что и были переданы нам.
    # В ответе мы должны получить словарь.
    context = super().get_context_data(**kwargs)
    # К словарю добавим текущую дату в ключ 'time_now'.
    context['time_now'] = datetime.utcnow()
    # Добавим ещё одну пустую переменную,
    # чтобы на её примере рассмотреть работу ещё одного фильтра.
    context['next_posts'] = "Самые свежие новости в мире спорта смотрите на нашем сайте"
    return context

class PostDetail(DetailView):
    # Модель всё та же, но мы хотим получать информацию по отдельной статье или новости
    model = Post
    # Используем другой шаблон — post.html
    template_name = 'news_id.html'
    # Название объекта, в котором будет выбранный пользователем пост(статья или новость)
    context_object_name = 'news_id'

